INSERT INTO performers ("name")
VALUES
	('Лолита'),
	('Корни'),
	('Король и шут'),
	('Баста'),
	('БИ-2');
  
 INSERT INTO genres ("name")
 VALUES
	('Rock'),
	('Pop'),
	('Hip Hop'),
	('Jazz'),
	('Electronic'),
	('Classical');
  
 INSERT INTO albums ("name", "year")
 VALUES
	('Ориентация север', '2007-08-05'),
	('Неформат', '2007-05-14'),
	('Дневники', '2005-11-20'),
	('Баста 1', '2006-08-15'),
	('Второй студийный альбом группы «‎Би-2»', '1998-12-30'),
	('Жаль, нет ружья', '2002-10-10'),
	('Так и живьём','2019-08-11');
 
 INSERT INTO tracks ("id_albums", "name", "duration")
 VALUES
 	(1,'Ориентация север', 3.20 * 60),
 	(2,'Оказалось', 3.10 * 60),
 	(3,'25-й этаж', 4.31 * 60),
 	(4,'Моя игра', 4.31 * 60),
 	(5,'Полковнику никто не пишет', 4.51 * 60),
 	(6,'Мой характер', 3.48 * 60),
 	(7,'Калифорния', 5.12 * 60),
 	(7,'vata', 10 * 60);
 
 INSERT INTO collection ("name","year")
 VALUES
 	('Поп 2000-х на русском: главное', '2000-10-15'),
 	('Хип-хоп 2000-х на русском: главное', '2000-11-15'),
 	('100 ПУДОВЫЙ ХИТ', '2018-04-17'),
 	('НОВЫЕ ЛУЧШИЕ ХИТЫ', '2018-07-30'),
 	('50 ЛУЧШИХ ПЕСЕН', '2019-09-05'),
 	('ТОП-20 ХИТОВ И НОВИНОК МУЗ-ТВ', '2019-03-20'),
 	('ВСЁ САМОЕ НОВОЕ И ЛУЧШЕЕ', '2020-03-15'),
 	('ТОП 60 ЛУЧШИХ НОВЫХ ПОПУЛЯРНЫХ ПЕСЕН', '2020-07-10');
 	
 

INSERT INTO performers_genres ("id_performers","id_genres")
VALUES
	(1,2),(2,1),(2,2),
	(3,1),(4,3),(5,1);

INSERT INTO performers_albums ("id_performers","id_albums")
VALUES
	(1,1),(1,2),(2,3),
	(3,6),(4,4),(5,5);

INSERT INTO tracks_collection ("id_collection","id_tracks")
VALUES
	(1,1),(1,2),(1,3),
	(2,4),(4,5),(6,6);


 	